In [15]:
import sqlite3

In [16]:
connection = sqlite3.connect('test.db')
connection

In [17]:
cursor = connection.cursor()

In [19]:
cursor.execute(''' 
Create Table If Not Exists employees(
               id Integer Primary Key,
               name Text Not Null,
               age Integer,
               department Text
               )
'''
)

connection.commit()

In [20]:
cursor.execute('''
Select * from employees
''')

In [21]:
cursor.execute('''
Insert into employees(name,age,department)
               values('Dev',24,'Data Analyst')
''')

cursor.execute('''
Insert into employees(name,age,department)
               values('Krishna',32,'Machine Learning')
''')

cursor.execute('''
Insert into employees(name,age,department)
               values('Paul',27,'Data Scientist')
''')

connection.commit()

In [23]:
cursor.execute('''Select * from employees''')
rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'Dev', 24, 'Data Analyst')
(2, 'Krishna', 32, 'Machine Learning')
(3, 'Paul', 27, 'Data Scientist')

In [24]:
cursor.execute('''
UPDATE employees
               set age = 34
               where name ='Dev'
''')
connection.commit()

In [ ]:
cursor.execute('''Select * from employees''')
rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'Dev', 34, 'Data Analyst')
(2, 'Krishna', 32, 'Machine Learning')
(3, 'Paul', 27, 'Data Scientist')

In [26]:
cursor.execute('''
DELETE from employees
               where name = 'Krishna'
               ''')
connection.commit()

In [27]:
cursor.execute('''Select * from employees''')
rows = cursor.fetchall()

for row in rows:
    print(row)

(1, 'Dev', 34, 'Data Analyst')
(3, 'Paul', 27, 'Data Scientist')

In [28]:
connection = sqlite3.connect('Project1.db')
cursor = connection.cursor()

cursor.execute('''
Create Table if not Exists Sales (
               id integer primary key,
               date text not null,
               product text not null,
               sales integer,
               region text
               )
''')
connection.commit()

In [30]:
sales_data = [
    ('2023-01-01', 'Product1', 100, 'North'),
    ('2023-01-02', 'Product2', 200, 'South'),
    ('2023-01-03', 'Product1', 150, 'East'),
    ('2023-01-04', 'Product3', 250, 'West'),
    ('2023-01-05', 'Product2', 300, 'North')
]

cursor.executemany('''
insert into Sales(date,product,sales,region)
                   values(?,?,?,?)
''',sales_data)

connection.commit()

In [31]:
cursor.execute('Select * from Sales')
rows = cursor.fetchall()

for row in rows:
    print(row)

(1, '2023-01-01', 'Product1', 100, 'North')
(2, '2023-01-02', 'Product2', 200, 'South')
(3, '2023-01-03', 'Product1', 150, 'East')
(4, '2023-01-04', 'Product3', 250, 'West')
(5, '2023-01-05', 'Product2', 300, 'North')

In [32]:
connection.close()

In [33]:
cursor.execute('Select * from Sales')
rows = cursor.fetchall()

for row in rows:
    print(row)

ProgrammingError: Cannot operate on a closed database.